book-safari-api/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "pages", "date_finished", "characters", "problem", "solution", "genre", "genre_rationale", "words_learned", "something_learned", "question", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "author" = ?, "pages" = ?, "date_finished" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "U. B. Past"], ["pages", 195], ["date_finished", "2020-10-02"], ["updated_at", "2020-10-05 17:00:33.583324"], ["id", 5]]